{
  "projects": [
    {
      "name": "Facebook Clone",
      "role": "Full Stack Developer",
      "images": "fb",
      "github": "https://github.com/jombastic/facebook-clone",
      "technologies": [
        "vue",
        "laravel",
        "js",
        "ts",
        "html5",
        "css3",
        "tailwindcss",
        "docker",
        "github"
      ],
      "title": "Recreating the Modern Social Platform",
      "description": "A feature-rich social media application built with Laravel, Vue.js and Inertia.js that enables users to create and manage their social presence. The platform includes a sophisticated image cropping system for profile pictures, a dynamic post creation interface with overlay functionality, and a real-time comment system. Users can navigate through a responsive feed, interact with posts, and manage their profile settings through an intuitive dropdown menu system. The application implements secure authentication with email verification and features a modern, component-based architecture with reusable UI elements like modals, buttons, and input fields."
    },
    {
      "name": "Job Board",
      "role": "Full Stack Developer",
      "images": "job",
      "github": "https://github.com/jombastic/job-board",
      "technologies": [
        "laravel",
        "html5",
        "css3",
        "tailwindcss",
        "docker",
        "github"
      ],
      "title": "Job Listing Platform",
      "description": "A comprehensive Laravel-based job board that connects job seekers with employers. Users can browse and filter job listings by tags, view detailed job descriptions, and apply for positions. Employers can create job postings with company information, manage their listings through a dedicated dashboard, and track application metrics. The platform features user authentication, file uploads for company logos, Markdown support for job descriptions, and a Stripe payment integration that charges $99 for basic job postings with an additional $19 option to highlight listings for better visibility. Built with a focus on user experience and modern design principles."
    },
    {
      "name": "ACME Constructions",
      "role": "Full Stack Developer",
      "images": "acme",
      "github": "https://github.com/jombastic/acme-constructions",
      "technologies": [
        "laravel",
        "html5",
        "css3",
        "docker",
        "github"
      ],
      "title": "An example website for a construction firm built with WinterCMS",
      "description": "While it doesn't feature a state of the art design, construction company website is built with WinterCMS, featuring a custom ACME theme. The site showcases construction projects, company news, and career opportunities through a responsive, SEO-optimized design. It includes a project portfolio, news section, employment listings, and contact system, all designed to enhance ACME Construction's digital presence and facilitate client engagement."
    },
    {
      "name": "IceTech",
      "url": "https://icetech.mk/",
      "role": "Full Stack Developer",
      "images": "ice",
      "technologies": [
        "vue",
        "nuxt",
        "html5",
        "css3",
        "tailwindcss",
        "github",
        "figma"
      ],
      "title": "Developing IceTech's High-Performance Website",
      "description": "Hired to develop IceTech's website, I collaborated with a third-party designer's Figma layout to create a site built entirely with Nuxt.js and Tailwind. My role was to turn this design into a fully responsive, high-performance website that aligns with IceTech's mission to empower businesses digitally. This project highlights my ability to independently handle complex builds and deliver seamless, polished results that effectively represent a brand's expertise—like IceTech's specialization in Adobe Experience Manager (AEM) and digital transformation solutions."
    },
    {
      "name": "Art House",
      "role": "Full Stack Developer",
      "images": "arthouse",
      "github": "https://github.com/jombastic/art-house",
      "technologies": [
        "vue",
        "laravel",
        "html5",
        "css3",
        "tailwindcss",
        "docker",
        "github"
      ],
      "title": "Activity Tracker Web Application",
      "description": "A modern web application built with Laravel and Livewire that helps users track and manage their daily activities. The application features a clean, intuitive interface for creating, editing, and filtering activities, with additional capabilities like email sharing and time tracking reports. It demonstrates full-stack development skills with features like pagination, date filtering, and email integration, all while maintaining a seamless single-page application experience.\nThis would be perfect for a portfolio as it showcases:\n- Full-stack development capabilities\n- Modern framework usage (Laravel + Livewire)\n- User experience considerations\n- Data management and filtering\n- Email integration\n- Report generation\n- Clean, maintainable code structure\n\nWould you like me to help you create a more detailed portfolio description or focus on specific technical aspects of the project?"
    }
  ],

  "technologies": {
    "html5": "HTML",
    "css3": "CSS",
    "js": "JavaScript",
    "ts": "Typescript",
    "vue": "Vue.js",
    "nuxt": "Nuxt.js",
    "react": "React.js",
    "jquery": "jQuery",
    "tailwindcss": "Tailwind",
    "bootstrap": "Bootstrap",
    "php": "PHP",
    "mysql": "MySql",
    "laravel": "Laravel",
    "codeigniter": "Codeigniter",
    "linux": "Linux",
    "docker": "Docker",
    "github": "GitHub",
    "figma": "Figma",
    "jira": "Jira",
    "ps": "Photoshop"
  }
}
